results/pgbenchResults_vmware_mac_ubuntu_2.txt
Starting new PGBench Test
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 334
query mode: simple
number of clients: 10
number of threads: 1
number of transactions per client: 100
number of transactions actually processed: 1000/1000
latency average = 8.851 ms
tps = 1129.830161 (including connections establishing)
tps = 1134.279479 (excluding connections establishing)
Starting new PGBench Test
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 334
query mode: simple
number of clients: 10
number of threads: 1
number of transactions per client: 100
number of transactions actually processed: 1000/1000
latency average = 9.608 ms
tps = 1040.792845 (including connections establishing)
tps = 1044.992718 (excluding connections establishing)
Starting new PGBench Test
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 334
query mode: simple
number of clients: 10
number of threads: 1
number of transactions per client: 100
number of transactions actually processed: 1000/1000
latency average = 8.984 ms
tps = 1113.095994 (including connections establishing)
tps = 1117.125482 (excluding connections establishing)
Starting new PGBench Test
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 334
query mode: simple
number of clients: 10
number of threads: 1
number of transactions per client: 100
number of transactions actually processed: 1000/1000
latency average = 9.843 ms
tps = 1015.900119 (including connections establishing)
tps = 1022.659703 (excluding connections establishing)
Starting new PGBench Test
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 334
query mode: simple
number of clients: 10
number of threads: 1
number of transactions per client: 100
number of transactions actually processed: 1000/1000
latency average = 9.118 ms
tps = 1096.781749 (including connections establishing)
tps = 1101.636764 (excluding connections establishing)